"""
5. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
"""
num_letter = int(input("Введите номер буквы:"))
letter = chr(num_letter)
print(f"Под номуром {num_letter} буква {letter}")
